==================
include rule
==================

include foo.ctb

---

(source_file
  (include
    (filename)))

==================
undefined rule
==================

undefined 123

---

(source_file
  (undefined
    (dots)))

==================
display rule
==================

display a 1

---

(source_file
  (display
    (chars)
    (dots)))

==================
display rule 2
==================

display a 123

---

(source_file
  (display
    (chars)
    (dots)))

==================
display rule 3
==================

display a 123-0

---

(source_file
  (display
    (chars)
    (dots)))

